# Brewfile, similar to a Gemfile but for Homebrew
# Go to https://github.com/Homebrew/homebrew-bundle for more info

# Taps
tap "caskroom/cask"
tap "homebrew/boneyard"
tap "homebrew/bundle"
tap "homebrew/core"

# Essentials
brew "git"
brew "jq"
brew "reattach-to-user-namespace"
brew "shellcheck"
brew "the_silver_searcher"
brew "ripgrep"
brew "thefuck"
brew "tmux"
brew "tree"
brew "vim", args: ["with-override-system-vi"]
brew "neovim"
brew "zsh"
brew "tig"
brew "xclip"

# Ruby
brew "ruby"
brew "ruby-build"
brew "rbenv"

# Python
brew "pyenv"

# GVM dependencies:
brew "mercurial"

# Things to build other things
brew "autoconf"
brew "automake"
brew "boost"
brew "cmake"
brew "gcc"

# Nice to haves
brew "cowsay"
brew "ctop"
brew "dos2unix"
brew "findutils"
brew "gist"
brew "gnu-sed", args: ["with-default-names"]
brew "gnutls"
brew "grep"
brew "htop"
brew "hub"
brew "mpssh"
brew "mtr"
brew "ngrep"
brew "nmap"
brew "node"
brew "openssh"
brew "rename"
brew "screenfetch"
brew "speedtest-cli"
brew "spoof-mac"
brew "ssh-copy-id"
brew "stunnel"
brew "watch"
brew "wget"
brew "xz"
brew "yamllint"

# Casks
cask "cyberduck"
cask "docker"
cask "evernote"
cask "google-chrome"
cask "firefox"
cask "iterm2"
cask "slack"
cask "vagrant"
cask "vlc"
cask "wireshark"
cask "xquartz"

